program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3304.5.2"}, {"coremlc-version", "3304.6.2"}, {"coremltools-component-torch", "2.2.2"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.1"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 640, 640]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 640, 640]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<int32, []> var_21 = const()[name = tensor<string, []>("op_21"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_22 = const()[name = tensor<string, []>("op_22"), val = tensor<int32, []>(2)];
            tensor<int32, [2]> var_60 = const()[name = tensor<string, []>("op_60"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_62 = const()[name = tensor<string, []>("op_62"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [48, 3, 3, 3]> model_model_0_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_0_conv_weight_to_fp16"), val = tensor<fp16, [48, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [48]> model_model_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_0_conv_bias_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2752)))];
            tensor<fp16, [1, 3, 640, 640]> cast_9 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_9")];
            tensor<fp16, [1, 48, 320, 320]> input_1_cast_fp16 = conv(bias = model_model_0_conv_bias_to_fp16, dilations = var_62, groups = var_21, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_60, weight = model_model_0_conv_weight_to_fp16, x = cast_9)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<fp16, [1, 48, 320, 320]> input_3_cast_fp16 = silu(x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [2]> var_69 = const()[name = tensor<string, []>("op_69"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_71 = const()[name = tensor<string, []>("op_71"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 48, 3, 3]> model_model_1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_1_conv_weight_to_fp16"), val = tensor<fp16, [96, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2944)))];
            tensor<fp16, [96]> model_model_1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_1_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(85952)))];
            tensor<fp16, [1, 96, 160, 160]> input_5_cast_fp16 = conv(bias = model_model_1_conv_bias_to_fp16, dilations = var_71, groups = var_21, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = var_69, weight = model_model_1_conv_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [1, 96, 160, 160]> input_7_cast_fp16 = silu(x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [2]> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_86 = const()[name = tensor<string, []>("op_86"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [96, 96, 1, 1]> model_model_2_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv1_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(86208)))];
            tensor<fp16, [96]> model_model_2_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv1_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104704)))];
            tensor<fp16, [1, 96, 160, 160]> input_9_cast_fp16 = conv(bias = model_model_2_cv1_conv_bias_to_fp16, dilations = var_86, groups = var_21, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_84, weight = model_model_2_cv1_conv_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [1, 96, 160, 160]> var_89_cast_fp16 = silu(x = input_9_cast_fp16)[name = tensor<string, []>("op_89_cast_fp16")];
            tensor<int32, [2]> var_90 = const()[name = tensor<string, []>("op_90"), val = tensor<int32, [2]>([48, 48])];
            tensor<int32, []> var_91_axis_0 = const()[name = tensor<string, []>("op_91_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 48, 160, 160]> var_91_cast_fp16_0, tensor<fp16, [1, 48, 160, 160]> var_91_cast_fp16_1 = split(axis = var_91_axis_0, split_sizes = var_90, x = var_89_cast_fp16)[name = tensor<string, []>("op_91_cast_fp16")];
            tensor<int32, [2]> var_99 = const()[name = tensor<string, []>("op_99"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_101 = const()[name = tensor<string, []>("op_101"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [48, 48, 3, 3]> model_model_2_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [48, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104960)))];
            tensor<fp16, [48]> model_model_2_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(146496)))];
            tensor<fp16, [1, 48, 160, 160]> input_13_cast_fp16 = conv(bias = model_model_2_m_0_cv1_conv_bias_to_fp16, dilations = var_101, groups = var_21, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_99, weight = model_model_2_m_0_cv1_conv_weight_to_fp16, x = var_91_cast_fp16_1)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1, 48, 160, 160]> input_15_cast_fp16 = silu(x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [2]> var_108 = const()[name = tensor<string, []>("op_108"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_110 = const()[name = tensor<string, []>("op_110"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [48, 48, 3, 3]> model_model_2_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [48, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(146688)))];
            tensor<fp16, [48]> model_model_2_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(188224)))];
            tensor<fp16, [1, 48, 160, 160]> input_17_cast_fp16 = conv(bias = model_model_2_m_0_cv2_conv_bias_to_fp16, dilations = var_110, groups = var_21, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = var_108, weight = model_model_2_m_0_cv2_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [1, 48, 160, 160]> var_113_cast_fp16 = silu(x = input_17_cast_fp16)[name = tensor<string, []>("op_113_cast_fp16")];
            tensor<fp16, [1, 48, 160, 160]> input_19_cast_fp16 = add(x = var_91_cast_fp16_1, y = var_113_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [2]> var_120 = const()[name = tensor<string, []>("op_120"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [48, 48, 3, 3]> model_model_2_m_1_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_1_cv1_conv_weight_to_fp16"), val = tensor<fp16, [48, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(188416)))];
            tensor<fp16, [48]> model_model_2_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(229952)))];
            tensor<fp16, [1, 48, 160, 160]> input_21_cast_fp16 = conv(bias = model_model_2_m_1_cv1_conv_bias_to_fp16, dilations = var_122, groups = var_21, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = var_120, weight = model_model_2_m_1_cv1_conv_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 48, 160, 160]> input_23_cast_fp16 = silu(x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [2]> var_129 = const()[name = tensor<string, []>("op_129"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_131 = const()[name = tensor<string, []>("op_131"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [48, 48, 3, 3]> model_model_2_m_1_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_1_cv2_conv_weight_to_fp16"), val = tensor<fp16, [48, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(230144)))];
            tensor<fp16, [48]> model_model_2_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(271680)))];
            tensor<fp16, [1, 48, 160, 160]> input_25_cast_fp16 = conv(bias = model_model_2_m_1_cv2_conv_bias_to_fp16, dilations = var_131, groups = var_21, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = var_129, weight = model_model_2_m_1_cv2_conv_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1, 48, 160, 160]> var_134_cast_fp16 = silu(x = input_25_cast_fp16)[name = tensor<string, []>("op_134_cast_fp16")];
            tensor<fp16, [1, 48, 160, 160]> var_135_cast_fp16 = add(x = input_19_cast_fp16, y = var_134_cast_fp16)[name = tensor<string, []>("op_135_cast_fp16")];
            tensor<bool, []> input_27_interleave_0 = const()[name = tensor<string, []>("input_27_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 160, 160]> input_27_cast_fp16 = concat(axis = var_21, interleave = input_27_interleave_0, values = (var_91_cast_fp16_0, var_91_cast_fp16_1, input_19_cast_fp16, var_135_cast_fp16))[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<int32, [2]> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_143 = const()[name = tensor<string, []>("op_143"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [96, 192, 1, 1]> model_model_2_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv2_conv_weight_to_fp16"), val = tensor<fp16, [96, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(271872)))];
            tensor<fp16, [96]> model_model_2_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv2_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(308800)))];
            tensor<fp16, [1, 96, 160, 160]> input_29_cast_fp16 = conv(bias = model_model_2_cv2_conv_bias_to_fp16, dilations = var_143, groups = var_21, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = var_141, weight = model_model_2_cv2_conv_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [1, 96, 160, 160]> input_31_cast_fp16 = silu(x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<int32, [2]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [192, 96, 3, 3]> model_model_3_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_3_conv_weight_to_fp16"), val = tensor<fp16, [192, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(309056)))];
            tensor<fp16, [192]> model_model_3_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_3_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(640896)))];
            tensor<fp16, [1, 192, 80, 80]> input_33_cast_fp16 = conv(bias = model_model_3_conv_bias_to_fp16, dilations = var_152, groups = var_21, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = var_150, weight = model_model_3_conv_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1, 192, 80, 80]> input_35_cast_fp16 = silu(x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [2]> var_169 = const()[name = tensor<string, []>("op_169"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_171 = const()[name = tensor<string, []>("op_171"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 192, 1, 1]> model_model_4_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv1_conv_weight_to_fp16"), val = tensor<fp16, [192, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(641344)))];
            tensor<fp16, [192]> model_model_4_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv1_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(715136)))];
            tensor<fp16, [1, 192, 80, 80]> input_37_cast_fp16 = conv(bias = model_model_4_cv1_conv_bias_to_fp16, dilations = var_171, groups = var_21, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = var_169, weight = model_model_4_cv1_conv_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [1, 192, 80, 80]> var_174_cast_fp16 = silu(x = input_37_cast_fp16)[name = tensor<string, []>("op_174_cast_fp16")];
            tensor<int32, [2]> var_175 = const()[name = tensor<string, []>("op_175"), val = tensor<int32, [2]>([96, 96])];
            tensor<int32, []> var_176_axis_0 = const()[name = tensor<string, []>("op_176_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 96, 80, 80]> var_176_cast_fp16_0, tensor<fp16, [1, 96, 80, 80]> var_176_cast_fp16_1 = split(axis = var_176_axis_0, split_sizes = var_175, x = var_174_cast_fp16)[name = tensor<string, []>("op_176_cast_fp16")];
            tensor<int32, [2]> var_184 = const()[name = tensor<string, []>("op_184"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_186 = const()[name = tensor<string, []>("op_186"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 96, 3, 3]> model_model_4_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(715584)))];
            tensor<fp16, [96]> model_model_4_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(881536)))];
            tensor<fp16, [1, 96, 80, 80]> input_41_cast_fp16 = conv(bias = model_model_4_m_0_cv1_conv_bias_to_fp16, dilations = var_186, groups = var_21, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = var_184, weight = model_model_4_m_0_cv1_conv_weight_to_fp16, x = var_176_cast_fp16_1)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> input_43_cast_fp16 = silu(x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<int32, [2]> var_193 = const()[name = tensor<string, []>("op_193"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_195 = const()[name = tensor<string, []>("op_195"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 96, 3, 3]> model_model_4_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(881792)))];
            tensor<fp16, [96]> model_model_4_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1047744)))];
            tensor<fp16, [1, 96, 80, 80]> input_45_cast_fp16 = conv(bias = model_model_4_m_0_cv2_conv_bias_to_fp16, dilations = var_195, groups = var_21, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = var_193, weight = model_model_4_m_0_cv2_conv_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> var_198_cast_fp16 = silu(x = input_45_cast_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> input_47_cast_fp16 = add(x = var_176_cast_fp16_1, y = var_198_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<int32, [2]> var_205 = const()[name = tensor<string, []>("op_205"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_207 = const()[name = tensor<string, []>("op_207"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_49_pad_type_0 = const()[name = tensor<string, []>("input_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_49_pad_0 = const()[name = tensor<string, []>("input_49_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 96, 3, 3]> model_model_4_m_1_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv1_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1048000)))];
            tensor<fp16, [96]> model_model_4_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1213952)))];
            tensor<fp16, [1, 96, 80, 80]> input_49_cast_fp16 = conv(bias = model_model_4_m_1_cv1_conv_bias_to_fp16, dilations = var_207, groups = var_21, pad = input_49_pad_0, pad_type = input_49_pad_type_0, strides = var_205, weight = model_model_4_m_1_cv1_conv_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> input_51_cast_fp16 = silu(x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<int32, [2]> var_214 = const()[name = tensor<string, []>("op_214"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_216 = const()[name = tensor<string, []>("op_216"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_53_pad_type_0 = const()[name = tensor<string, []>("input_53_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_53_pad_0 = const()[name = tensor<string, []>("input_53_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 96, 3, 3]> model_model_4_m_1_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv2_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1214208)))];
            tensor<fp16, [96]> model_model_4_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1380160)))];
            tensor<fp16, [1, 96, 80, 80]> input_53_cast_fp16 = conv(bias = model_model_4_m_1_cv2_conv_bias_to_fp16, dilations = var_216, groups = var_21, pad = input_53_pad_0, pad_type = input_53_pad_type_0, strides = var_214, weight = model_model_4_m_1_cv2_conv_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> var_219_cast_fp16 = silu(x = input_53_cast_fp16)[name = tensor<string, []>("op_219_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> input_55_cast_fp16 = add(x = input_47_cast_fp16, y = var_219_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<int32, [2]> var_226 = const()[name = tensor<string, []>("op_226"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 96, 3, 3]> model_model_4_m_2_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_2_cv1_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1380416)))];
            tensor<fp16, [96]> model_model_4_m_2_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_2_cv1_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1546368)))];
            tensor<fp16, [1, 96, 80, 80]> input_57_cast_fp16 = conv(bias = model_model_4_m_2_cv1_conv_bias_to_fp16, dilations = var_228, groups = var_21, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = var_226, weight = model_model_4_m_2_cv1_conv_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> input_59_cast_fp16 = silu(x = input_57_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<int32, [2]> var_235 = const()[name = tensor<string, []>("op_235"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_237 = const()[name = tensor<string, []>("op_237"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 96, 3, 3]> model_model_4_m_2_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_2_cv2_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1546624)))];
            tensor<fp16, [96]> model_model_4_m_2_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_2_cv2_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1712576)))];
            tensor<fp16, [1, 96, 80, 80]> input_61_cast_fp16 = conv(bias = model_model_4_m_2_cv2_conv_bias_to_fp16, dilations = var_237, groups = var_21, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = var_235, weight = model_model_4_m_2_cv2_conv_weight_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> var_240_cast_fp16 = silu(x = input_61_cast_fp16)[name = tensor<string, []>("op_240_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> input_63_cast_fp16 = add(x = input_55_cast_fp16, y = var_240_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<int32, [2]> var_247 = const()[name = tensor<string, []>("op_247"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_249 = const()[name = tensor<string, []>("op_249"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_65_pad_type_0 = const()[name = tensor<string, []>("input_65_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_65_pad_0 = const()[name = tensor<string, []>("input_65_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 96, 3, 3]> model_model_4_m_3_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_3_cv1_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1712832)))];
            tensor<fp16, [96]> model_model_4_m_3_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_3_cv1_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1878784)))];
            tensor<fp16, [1, 96, 80, 80]> input_65_cast_fp16 = conv(bias = model_model_4_m_3_cv1_conv_bias_to_fp16, dilations = var_249, groups = var_21, pad = input_65_pad_0, pad_type = input_65_pad_type_0, strides = var_247, weight = model_model_4_m_3_cv1_conv_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> input_67_cast_fp16 = silu(x = input_65_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<int32, [2]> var_256 = const()[name = tensor<string, []>("op_256"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_258 = const()[name = tensor<string, []>("op_258"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_69_pad_type_0 = const()[name = tensor<string, []>("input_69_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_69_pad_0 = const()[name = tensor<string, []>("input_69_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [96, 96, 3, 3]> model_model_4_m_3_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_3_cv2_conv_weight_to_fp16"), val = tensor<fp16, [96, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1879040)))];
            tensor<fp16, [96]> model_model_4_m_3_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_3_cv2_conv_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2044992)))];
            tensor<fp16, [1, 96, 80, 80]> input_69_cast_fp16 = conv(bias = model_model_4_m_3_cv2_conv_bias_to_fp16, dilations = var_258, groups = var_21, pad = input_69_pad_0, pad_type = input_69_pad_type_0, strides = var_256, weight = model_model_4_m_3_cv2_conv_weight_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> var_261_cast_fp16 = silu(x = input_69_cast_fp16)[name = tensor<string, []>("op_261_cast_fp16")];
            tensor<fp16, [1, 96, 80, 80]> var_262_cast_fp16 = add(x = input_63_cast_fp16, y = var_261_cast_fp16)[name = tensor<string, []>("op_262_cast_fp16")];
            tensor<bool, []> input_71_interleave_0 = const()[name = tensor<string, []>("input_71_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 576, 80, 80]> input_71_cast_fp16 = concat(axis = var_21, interleave = input_71_interleave_0, values = (var_176_cast_fp16_0, var_176_cast_fp16_1, input_47_cast_fp16, input_55_cast_fp16, input_63_cast_fp16, var_262_cast_fp16))[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<int32, [2]> var_268 = const()[name = tensor<string, []>("op_268"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_270 = const()[name = tensor<string, []>("op_270"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_73_pad_type_0 = const()[name = tensor<string, []>("input_73_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_73_pad_0 = const()[name = tensor<string, []>("input_73_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 576, 1, 1]> model_model_4_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv2_conv_weight_to_fp16"), val = tensor<fp16, [192, 576, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2045248)))];
            tensor<fp16, [192]> model_model_4_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv2_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2266496)))];
            tensor<fp16, [1, 192, 80, 80]> input_73_cast_fp16 = conv(bias = model_model_4_cv2_conv_bias_to_fp16, dilations = var_270, groups = var_21, pad = input_73_pad_0, pad_type = input_73_pad_type_0, strides = var_268, weight = model_model_4_cv2_conv_weight_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<fp16, [1, 192, 80, 80]> input_75_cast_fp16 = silu(x = input_73_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<int32, [2]> var_277 = const()[name = tensor<string, []>("op_277"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_279 = const()[name = tensor<string, []>("op_279"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_77_pad_type_0 = const()[name = tensor<string, []>("input_77_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_77_pad_0 = const()[name = tensor<string, []>("input_77_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [384, 192, 3, 3]> model_model_5_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_5_conv_weight_to_fp16"), val = tensor<fp16, [384, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2266944)))];
            tensor<fp16, [384]> model_model_5_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_5_conv_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3594112)))];
            tensor<fp16, [1, 384, 40, 40]> input_77_cast_fp16 = conv(bias = model_model_5_conv_bias_to_fp16, dilations = var_279, groups = var_21, pad = input_77_pad_0, pad_type = input_77_pad_type_0, strides = var_277, weight = model_model_5_conv_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<fp16, [1, 384, 40, 40]> input_79_cast_fp16 = silu(x = input_77_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<int32, [2]> var_296 = const()[name = tensor<string, []>("op_296"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_298 = const()[name = tensor<string, []>("op_298"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_81_pad_type_0 = const()[name = tensor<string, []>("input_81_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_81_pad_0 = const()[name = tensor<string, []>("input_81_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 384, 1, 1]> model_model_6_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_cv1_conv_weight_to_fp16"), val = tensor<fp16, [384, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3594944)))];
            tensor<fp16, [384]> model_model_6_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_cv1_conv_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3889920)))];
            tensor<fp16, [1, 384, 40, 40]> input_81_cast_fp16 = conv(bias = model_model_6_cv1_conv_bias_to_fp16, dilations = var_298, groups = var_21, pad = input_81_pad_0, pad_type = input_81_pad_type_0, strides = var_296, weight = model_model_6_cv1_conv_weight_to_fp16, x = input_79_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, [1, 384, 40, 40]> var_301_cast_fp16 = silu(x = input_81_cast_fp16)[name = tensor<string, []>("op_301_cast_fp16")];
            tensor<int32, [2]> var_302 = const()[name = tensor<string, []>("op_302"), val = tensor<int32, [2]>([192, 192])];
            tensor<int32, []> var_303_axis_0 = const()[name = tensor<string, []>("op_303_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 192, 40, 40]> var_303_cast_fp16_0, tensor<fp16, [1, 192, 40, 40]> var_303_cast_fp16_1 = split(axis = var_303_axis_0, split_sizes = var_302, x = var_301_cast_fp16)[name = tensor<string, []>("op_303_cast_fp16")];
            tensor<int32, [2]> var_311 = const()[name = tensor<string, []>("op_311"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_313 = const()[name = tensor<string, []>("op_313"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_85_pad_type_0 = const()[name = tensor<string, []>("input_85_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_85_pad_0 = const()[name = tensor<string, []>("input_85_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [192, 192, 3, 3]> model_model_6_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [192, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3890752)))];
            tensor<fp16, [192]> model_model_6_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4554368)))];
            tensor<fp16, [1, 192, 40, 40]> input_85_cast_fp16 = conv(bias = model_model_6_m_0_cv1_conv_bias_to_fp16, dilations = var_313, groups = var_21, pad = input_85_pad_0, pad_type = input_85_pad_type_0, strides = var_311, weight = model_model_6_m_0_cv1_conv_weight_to_fp16, x = var_303_cast_fp16_1)[name = tensor<string, []>("input_85_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> input_87_cast_fp16 = silu(x = input_85_cast_fp16)[name = tensor<string, []>("input_87_cast_fp16")];
            tensor<int32, [2]> var_320 = const()[name = tensor<string, []>("op_320"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_322 = const()[name = tensor<string, []>("op_322"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_89_pad_type_0 = const()[name = tensor<string, []>("input_89_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_89_pad_0 = const()[name = tensor<string, []>("input_89_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [192, 192, 3, 3]> model_model_6_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [192, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4554816)))];
            tensor<fp16, [192]> model_model_6_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5218432)))];
            tensor<fp16, [1, 192, 40, 40]> input_89_cast_fp16 = conv(bias = model_model_6_m_0_cv2_conv_bias_to_fp16, dilations = var_322, groups = var_21, pad = input_89_pad_0, pad_type = input_89_pad_type_0, strides = var_320, weight = model_model_6_m_0_cv2_conv_weight_to_fp16, x = input_87_cast_fp16)[name = tensor<string, []>("input_89_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> var_325_cast_fp16 = silu(x = input_89_cast_fp16)[name = tensor<string, []>("op_325_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> input_91_cast_fp16 = add(x = var_303_cast_fp16_1, y = var_325_cast_fp16)[name = tensor<string, []>("input_91_cast_fp16")];
            tensor<int32, [2]> var_332 = const()[name = tensor<string, []>("op_332"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_334 = const()[name = tensor<string, []>("op_334"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_93_pad_type_0 = const()[name = tensor<string, []>("input_93_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_93_pad_0 = const()[name = tensor<string, []>("input_93_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [192, 192, 3, 3]> model_model_6_m_1_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv1_conv_weight_to_fp16"), val = tensor<fp16, [192, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5218880)))];
            tensor<fp16, [192]> model_model_6_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5882496)))];
            tensor<fp16, [1, 192, 40, 40]> input_93_cast_fp16 = conv(bias = model_model_6_m_1_cv1_conv_bias_to_fp16, dilations = var_334, groups = var_21, pad = input_93_pad_0, pad_type = input_93_pad_type_0, strides = var_332, weight = model_model_6_m_1_cv1_conv_weight_to_fp16, x = input_91_cast_fp16)[name = tensor<string, []>("input_93_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> input_95_cast_fp16 = silu(x = input_93_cast_fp16)[name = tensor<string, []>("input_95_cast_fp16")];
            tensor<int32, [2]> var_341 = const()[name = tensor<string, []>("op_341"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_343 = const()[name = tensor<string, []>("op_343"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_97_pad_type_0 = const()[name = tensor<string, []>("input_97_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_97_pad_0 = const()[name = tensor<string, []>("input_97_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [192, 192, 3, 3]> model_model_6_m_1_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv2_conv_weight_to_fp16"), val = tensor<fp16, [192, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5882944)))];
            tensor<fp16, [192]> model_model_6_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6546560)))];
            tensor<fp16, [1, 192, 40, 40]> input_97_cast_fp16 = conv(bias = model_model_6_m_1_cv2_conv_bias_to_fp16, dilations = var_343, groups = var_21, pad = input_97_pad_0, pad_type = input_97_pad_type_0, strides = var_341, weight = model_model_6_m_1_cv2_conv_weight_to_fp16, x = input_95_cast_fp16)[name = tensor<string, []>("input_97_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> var_346_cast_fp16 = silu(x = input_97_cast_fp16)[name = tensor<string, []>("op_346_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> input_99_cast_fp16 = add(x = input_91_cast_fp16, y = var_346_cast_fp16)[name = tensor<string, []>("input_99_cast_fp16")];
            tensor<int32, [2]> var_353 = const()[name = tensor<string, []>("op_353"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_355 = const()[name = tensor<string, []>("op_355"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_101_pad_type_0 = const()[name = tensor<string, []>("input_101_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_101_pad_0 = const()[name = tensor<string, []>("input_101_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [192, 192, 3, 3]> model_model_6_m_2_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_2_cv1_conv_weight_to_fp16"), val = tensor<fp16, [192, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6547008)))];
            tensor<fp16, [192]> model_model_6_m_2_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_2_cv1_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7210624)))];
            tensor<fp16, [1, 192, 40, 40]> input_101_cast_fp16 = conv(bias = model_model_6_m_2_cv1_conv_bias_to_fp16, dilations = var_355, groups = var_21, pad = input_101_pad_0, pad_type = input_101_pad_type_0, strides = var_353, weight = model_model_6_m_2_cv1_conv_weight_to_fp16, x = input_99_cast_fp16)[name = tensor<string, []>("input_101_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> input_103_cast_fp16 = silu(x = input_101_cast_fp16)[name = tensor<string, []>("input_103_cast_fp16")];
            tensor<int32, [2]> var_362 = const()[name = tensor<string, []>("op_362"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_364 = const()[name = tensor<string, []>("op_364"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_105_pad_type_0 = const()[name = tensor<string, []>("input_105_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_105_pad_0 = const()[name = tensor<string, []>("input_105_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [192, 192, 3, 3]> model_model_6_m_2_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_2_cv2_conv_weight_to_fp16"), val = tensor<fp16, [192, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7211072)))];
            tensor<fp16, [192]> model_model_6_m_2_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_2_cv2_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7874688)))];
            tensor<fp16, [1, 192, 40, 40]> input_105_cast_fp16 = conv(bias = model_model_6_m_2_cv2_conv_bias_to_fp16, dilations = var_364, groups = var_21, pad = input_105_pad_0, pad_type = input_105_pad_type_0, strides = var_362, weight = model_model_6_m_2_cv2_conv_weight_to_fp16, x = input_103_cast_fp16)[name = tensor<string, []>("input_105_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> var_367_cast_fp16 = silu(x = input_105_cast_fp16)[name = tensor<string, []>("op_367_cast_fp16")];
            tensor<fp16, [1, 192, 40, 40]> input_107_cast_fp16 = add(x = input_99_cast_fp16, y = var_367_cast_fp16)[name = tensor<string, []>("input_107_cast_fp16")];
            tensor<int32, [2]> var_374 = const()[name = tensor<string, []>("op_374"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_376 = const()[name = tensor<string, []>("op_376"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_109_pad_type_0 = const()[name = tensor<string, []>("input_109_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_109_pad_0 = const()[name = tensor<string, []>("input_109_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [192, 192, 3, 3]> model_model_6_m_3_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_3_cv1_conv_weight_to_fp16"), val = tensor<fp16, [192, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7875136)))];
            tensor<fp16, [192]> model_model_6_m_3_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_3_cv1_conv_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8538752)))];
